[
  {
    "_type": "caseStudy",
    "title": "AI-Powered Healthcare Dashboard Form Intake (EPSI)",
    "slug": { "_type": "slug", "current": "ai-powered-healthcare-dashboard-form-intake-epsi" },
    "overview": "Enterprise Precision Scanning and Indexing (EPSI) is a secure, web-based platform developed for the Veterans Health Administration to facilitate the seamless intake and management of patient records received as faxes and converted to PDF files from external care providers. The application equips authorized VA personnel with the tools to efficiently attach submitted documents to the correct patient profile within the Veterans Health Information Systems and Technology Architecture (VistA). Throughout this process, EPSI not only supports rigorous data verification and secure storage protocols but also automates document retention and disposal in full alignment with federal privacy requirements. By bridging external records and VA systems, EPSI ensures that critical health information is accurately captured, easily accessible to care teams, and protected at every stage of its lifecycle.",
    "challenge": "Before EPSI, clinical records from external providers were managed through outdated systems and spreadsheet-based manual workflows. This resulted in workflow bottlenecks, data integrity risks, inconsistent user experiences, and elevated privacy and security concerns. The primary design challenge was to digitize and modernize this process while safeguarding privacy, minimizing retention of sensitive information, and upholding strict federal standards for data security and access.",
    "approach": "As the product designer, I guided the team through the double diamond methodology—exploring divergent ideas and building convergent solutions. My human-centered, iterative design process included: User Research: I interviewed VHA staff (indexers, administrators, privacy officers) to map existing pain points in the document intake and indexing workflow. Prototyping & Validation: Using Axure, I rapidly iterated on interactive prototypes, enabling usability testing with actual end users. This surfaced real-world concerns, such as information overload and the critical need for verification at each workflow stage. Design Systems & Methodology: I standardized UI components in Figma, aligning with US Web Design System (USWDS) and VA-specific guidelines. Every element—buttons, data entry forms, confirmation screens—was stress-tested for accessibility and privacy compliance. Privacy by Design: Collaborating with security and privacy officers, I baked privacy controls into the UX, such as clear user roles, audit logs, automated purging of sensitive data, and inline guidance about privacy responsibilities. Documentation & Onboarding: I authored accessible documentation and workflow guides to facilitate smooth onboarding of new users and support ongoing compliance.",
    "keySolutions": [
      "Streamlined, end-to-end digital workflow for secure intake, indexing, and transfer of external PDF health records.",
      "Minimal-click design: users can quickly scan for details and complete tasks accurately, reducing time and effort.",
      "Role-based access and comprehensive audit trails to ensure privacy and accountability.",
      "Automated data validation and confirmation steps to prevent errors before upload.",
      "Integrated OCR and generative AI for fast, accurate document parsing and data extraction.",
      "Flexible user flows that adapt to different document types and staff needs.",
      "'Pick your adventure' prompt writing, enabling flexible workflow guidance tailored to user needs and document types.",
      "Accessible, privacy-first interface aligned with VA and USWDS standards.",
      "All forms are screen-reader accessible and meet WCAG 2.1 AA standards."
    ],
    "outcome": "EPSI delivered measurable improvements in efficiency, accuracy, and compliance for VHA staff and workflows. Reduced manual data entry workload by 40%, enabling staff to complete more tasks within the allotted time. Improved data accuracy and reduced misidentification errors by implementing multi-factor verification and automated checks. Decreased average time to index and transfer documents by over 60% compared to previous manual workflows. Ensured 100% compliance with federal privacy and retention requirements through automated purging and audit trails. Received positive user feedback for ease of use, clarity of workflow, and increased confidence in data handling.",
    "reflection": "Designing EPSI was a powerful reminder of the responsibility that comes with handling sensitive health information. The project challenged me to balance innovation with privacy, ensuring that every design decision protected both data and dignity. Collaborating with privacy officers and end users deepened my appreciation for the complexities of healthcare workflows and the importance of clear, accessible interfaces. Ultimately, EPSI reinforced my belief that great design is not just about efficiency or aesthetics, but about building trust and empowering people—both staff and Veterans—at every step of the journey.",
    "teamList": [
      "1 Product Designer",
      "5 Engineers",
      "1 Data Scientist",
      "1 Business Analyst",
      "1 Product Manager"
    ],
    "tags": ["AI", "HEALTHCARE UX", "PRODUCT DESIGN"],
    "images": []
  }
] 