[
  {
    "id": "epsi",
    "title": "AI-Powered Healthcare Dashboard Form Intake (EPSI)",
    "company": "Veterans Affairs",
    "year": "2022–2025",
    "tags": ["AI", "HEALTHCARE UX", "PRODUCT DESIGN"],
    "intro": "Enterprise Precision Scanning and Indexing (EPSI) is a secure, web-based platform developed for the Veterans Health Administration to facilitate the seamless intake and management of patient records received as faxes and converted to PDF files from external care providers. The application equips authorized VA personnel with the tools to efficiently attach submitted documents to the correct patient profile within the Veterans Health Information Systems and Technology Architecture (VistA). Throughout this process, EPSI not only supports rigorous data verification and secure storage protocols but also automates document retention and disposal in full alignment with federal privacy requirements. By bridging external records and VA systems, EPSI ensures that critical health information is accurately captured, easily accessible to care teams, and protected at every stage of its lifecycle.",
    "image": "https://images.unsplash.com/photo-1545235617-9465d2a55698?ixlib=rb-4.0.3&auto=format&fit=crop&w=800&q=80",
    "platform": "Web App, Internal Software, AWS Healthcare Generative AI",
    "teamList": "1 Product Designer, 5 Engineers, 1 Data Scientist, 1 Business Analyst, 1 Product Manager",
    "sections": [
      { "heading": "Project Overview", "content": "<span style='font-weight:600;'>Enterprise Precision Scanning and Indexing (EPSI)</span> is a web-based solution designed for the Veterans Health Administration to streamline the intake, organization, and secure transfer of PDF medical documents from community care providers into Veteran patient records. Given the sensitive nature of the data managed—encompassing Personally Identifiable Information (PII) and Protected Health Information (PHI)—the product demands not only functional excellence but also a privacy-first design approach that instills trust, efficiency, and accessibility for staff and Veterans alike." },
      { "heading": "Challenge", "content": "Before EPSI, clinical records from external providers were managed through outdated systems and spreadsheet-based manual workflows. This resulted in workflow bottlenecks, data integrity risks, inconsistent user experiences, and elevated privacy and security concerns. The primary design challenge was to digitize and modernize this process while safeguarding privacy, minimizing retention of sensitive information, and upholding strict federal standards for data security and access." },
      { "heading": "Process", "content": "As the product designer, I guided the team through the double diamond methodology—exploring divergent ideas and building convergent solutions. My human-centered, iterative design process included:<ul style='margin-left:1.5em;'><li><strong>User Research:</strong> I interviewed VHA staff (indexers, administrators, privacy officers) to map existing pain points in the document intake and indexing workflow.</li><li><strong>Prototyping & Validation:</strong> Using Axure, I rapidly iterated on interactive prototypes, enabling usability testing with actual end users. This surfaced real-world concerns, such as information overload and the critical need for verification at each workflow stage.</li><li><strong>Design Systems & Methodology:</strong> I standardized UI components in Figma, aligning with US Web Design System (USWDS) and VA-specific guidelines. Every element—buttons, data entry forms, confirmation screens—was stress-tested for accessibility and privacy compliance.</li><li><strong>Privacy by Design:</strong> Collaborating with security and privacy officers, I baked privacy controls into the UX, such as clear user roles, audit logs, automated purging of sensitive data, and inline guidance about privacy responsibilities.</li><li><strong>Documentation & Onboarding:</strong> I authored accessible documentation and workflow guides to facilitate smooth onboarding of new users and support ongoing compliance.</li></ul>" },
      { "heading": "Key Solutions", "content": "<ul style='margin-left:1.5em; list-style: disc;'><li>Streamlined, end-to-end digital workflow for secure intake, indexing, and transfer of external PDF health records.</li><li>Minimal-click design: users can quickly scan for details and complete tasks accurately, reducing time and effort.</li><li>Role-based access and comprehensive audit trails to ensure privacy and accountability.</li><li>Automated data validation and confirmation steps to prevent errors before upload.</li><li>Integrated OCR and generative AI for fast, accurate document parsing and data extraction.</li><li>Flexible user flows that adapt to different document types and staff needs.</li><li>'Pick your adventure' prompt writing, enabling flexible workflow guidance tailored to user needs and document types.</li><li>Accessible, privacy-first interface aligned with VA and USWDS standards.</li><li>All forms are screen-reader accessible and meet WCAG 2.1 AA standards.</li></ul>" },
      { "heading": "Results", "content": "EPSI delivered measurable improvements in efficiency, accuracy, and compliance for VHA staff and workflows.<br/><ul style='margin-left:1.5em;'><li>Reduced manual data entry workload by 40%, enabling staff to complete more tasks within the allotted time.</li><li>Improved data accuracy and reduced misidentification errors by implementing multi-factor verification and automated checks.</li><li>Decreased average time to index and transfer documents by over 60% compared to previous manual workflows.</li><li>Ensured 100% compliance with federal privacy and retention requirements through automated purging and audit trails.</li><li>Received positive user feedback for ease of use, clarity of workflow, and increased confidence in data handling.</li></ul>" },
      { "heading": "Reflections", "content": "<p>Designing EPSI was a powerful reminder of the responsibility that comes with handling sensitive health information. The project challenged me to balance innovation with privacy, ensuring that every design decision protected both data and dignity. Collaborating with privacy officers and end users deepened my appreciation for the complexities of healthcare workflows and the importance of clear, accessible interfaces. Ultimately, EPSI reinforced my belief that great design is not just about efficiency or aesthetics, but about building trust and empowering people—both staff and Veterans—at every step of the journey.</p>" }
    ],
    "role": "Lead product designer\nFacilitation",
    "methodology": "Double Diamond\nAgile\nScrum\nUser-Centered Design"
  },
  {
    "id": "seoc",
    "title": "AI Powered Workflow to Enhance Standardized Episodes of Care (SEOC)",
    "company": "Veterans Affairs",
    "year": "2024–2025",
    "tags": ["AI", "Healthcare Innovation"],
    "intro": "Leading a multidisciplinary team, I architected an intuitive solution streamlining the creation and management of SEOCs, driving both clinical and operational improvements.",
    "image": "https://images.unsplash.com/photo-1558655146-d09347e92766?ixlib=rb-4.0.3&auto=format&fit=crop&w=800&q=80",
    "platform": "Web App, Internal Software, AWS Healthcare Generative AI",
    "teamList": "1 Product Designer, 6 Engineers, 1 Data Scientist, 1 Business Analyst, 1 Product Manager",
    "sections": [
      { "heading": "Project Overview", "image": "https://images.unsplash.com/photo-1506744038136-46273834b3fb?auto=format&fit=crop&w=800&q=80", "content": "Transforming complex healthcare processes into approachable, effective digital tools can have a profound impact on both patients and providers. Leveraging AI-driven tools and automation, the solution intelligently streamlined complex decision points and data validation, reducing manual effort and improving accuracy throughout the SEOC lifecycle. In this project, a collaborative, user-centered approach was used to reimagine how standardized care pathways are experienced in a clinical setting. The SEOC process, which operates under congressional oversight, required particular attention to compliance, transparency, and accountability. Through close partnership with VA employees and careful attention to intuitive design, the resulting solution made critical workflows clearer and more adaptable. As a result, teams are able to deliver consistent, high-quality care while also supporting the unique needs of the Veterans Affairs—demonstrating the power of thoughtful digital innovation in healthcare." },
      { "heading": "Challenge", "image": "https://images.unsplash.com/photo-1505751172876-fa1923c5c528?auto=format&fit=crop&w=800&q=80", "content": "The management and creation of Standardized Episodes of Care (SEOCs) had become increasingly challenging, relying on fragmented tools—spreadsheets for tracking workflow and an aging platform for publishing content. Because the existing product was developed before design standards were in place, its interface lacked consistency and intuitiveness, posing usability challenges for both clinical and administrative teams. Inefficiencies surfaced as teams manually duplicated features, managed parallel data entry, and wrestled with maintaining accuracy across multiple sources. Recognizing these pain points, I took an active leadership role in envisioning a more cohesive solution. By championing a unified approach to design and workflow integration, I aimed to streamline SEOC management, reduce redundancy, and create a more intuitive experience for users. This shift not only opened the door to operational efficiencies, but also laid the foundation for greater scalability, better data integrity, and an improved user experience going forward." },
      { "heading": "Approach", "image": "https://images.unsplash.com/photo-1465101046530-73398c7f28ca?auto=format&fit=crop&w=800&q=80", "content": "To bridge this gap, I engaged directly with clinical stakeholders, including authors, coders (people who assign medical codes to SEOCs) and publishers. Through a series of workshops and interviews, I identified pain points in the existing workflows and gathered insights into the distinct requirements of each pathway. My strategy centered on two key objectives:<ul class='list-disc pl-6 mb-2'><li><strong>Creating Intuitive Interfaces:</strong> I translated complex, often detailed medical protocols into clear, actionable digital experiences. Leveraging user-centered design principles, I crafted interface prototypes that distilled clinical pathways into step-by-step guidance for providers at the point of care.</li><li><strong>Supporting Individualized Needs:</strong> While maintaining standardized protocols, I ensured that digital tools allowed flexibility to address unique conditions and preferences. For example, conditional logic and customizable fields enabled authors to adapt care plans without recreating the entire form and easing maintaining established standards.</li></ul>" },
      { "heading": "Process", "image": "https://images.unsplash.com/photo-1503676382389-4809596d5290?auto=format&fit=crop&w=800&q=80", "content": "As the product designer, I led the integration of a robust design system grounded in the United States Web Design System (USWDS) and VA design language. From the beginning, I prioritized scalability, accessibility, and collaboration by building a library of reusable components and design tokens complemented by detailed documentation and accessibility guidelines. To ensure consistent implementation and efficient workflows, I established automated testing protocols, further assuring high standards across all deliverables.<div style='text-align:center; margin: 2rem 0;'><img src='/Framework_for_Innovation_transparent.png' alt='Double Diamond design process diagram: Discover, Define, Develop, Deliver' style='max-width:600px; width:100%; height:auto; border-radius:0.5rem; background:var(--bg-primary); margin: 0 auto;' /></div><h3 class='text-xl font-semibold mt-6 mb-2' style='color:var(--text-primary)'>Double Diamond Methodology</h3>Throughout the process, I embraced the Double Diamond methodology—first focusing on discovery and definition to deeply understand user pain points and product goals, then proceeding to ideation and delivery for effective solution development.<ul class='list-disc pl-6 mb-2'><li><strong>Discovery & Definition:</strong> During the divergent thinking phase, I engaged stakeholders and clinical users in co-design workshops, ensuring a breadth of ideas and insights informed our direction.</li><li><strong>Ideation & Delivery:</strong> Prototyping played a key role in our iterative approach. I utilized Axure to quickly build interactive prototypes, allowing clinical and administrative users to visualize and test new workflows early and often. These interactive models provided invaluable feedback on functionality and usability, which I incorporated into high-fidelity designs within Figma.</li></ul>In Figma, I documented every component and interaction, creating a single source of truth for both designers and developers. AI-powered algorithms were integrated to assist with workflow automation, predictive analytics, and intelligent recommendations, enabling teams to make faster, data-informed decisions and further enhancing the platform’s efficiency. This design-led, user-centered approach not only resulted in a scalable and accessible design system, but also fostered stronger collaboration across teams and empowered stakeholders to deliver consistent, high-quality care through more intuitive and adaptable SEOC management tools." },
      { "heading": "Results", "image": "https://images.unsplash.com/photo-1464983953574-0892a716854b?auto=format&fit=crop&w=800&q=80", "content": "<ul class='list-disc pl-5 mb-4'><li>Reduced manual effort by 30%</li><li>Improved usability by 62% and decreased cognitive load, as measured by task completion success and user feedback</li><li>Reduced average time to complete key tasks from 37 minutes to less than 6 minutes</li><li>Greatly improved the complexity and intuitiveness of medical coding SEOCs</li><li>Increased user confidence and trust</li></ul>Early feedback from stakeholders highlighted a marked reduction in redundant work and fostered more trust and increased confidence among users. The design system’s robust documentation and reusable components also accelerated future development, enabling teams to quickly adapt and scale the solution as needs evolved. Ultimately, these improvements empowered the VA to deliver more consistent, high-quality care, while freeing up valuable time for both clinicians and administrators to focus on what matters most—serving Veterans." },
      { "heading": "Reflections", "content": "<p>Leading design for the SEOC project was a transformative experience that challenged me to grow as a leader and collaborator. Navigating the complexities of healthcare and technology, I learned the value of patience, empathy, and clear communication. One of the most significant lessons was the importance of engaging stakeholders early and often—co-design workshops and iterative feedback loops ensured the solution truly addressed user needs and organizational goals. Embracing the Double Diamond methodology provided a clear structure for navigating complexity, while the integration of AI-driven tools demonstrated how technology can amplify human expertise and streamline decision-making.</p><p>The project also highlighted the necessity of robust documentation and scalable systems to support long-term growth and adaptability. This experience has shaped how I approach every new challenge—with curiosity, rigor, and a commitment to user-centered design. Ultimately, it deepened my appreciation for the power of thoughtful design, agile teamwork, and the impact that a user-centered, data-informed approach can have on improving care delivery and operational efficiency.</p>" }
    ],
    "role": "Lead Product Designer\nFacilitation",
    "methodology": "Double Diamond\nAgile\nScrum\nUser-Centered Design"
  },
  {
    "id": "resilience",
    "title": "Automating Patient-Therapist Alignment in the COVID-19 Recovery Era",
    "company": "Resilience Lab",
    "year": "2022-2023",
    "tags": ["UX RESEARCH", "PRODUCT DESIGN", "STRATEGY", "LEADERSHIP", "DESIGN LEADERSHIP"],
    "intro": "Resilience Lab is a modern therapy collective leveraging data and design to deliver collaborative, high-quality mental healthcare. As pandemic restrictions eased and patient needs evolved, the company needed to automate and personalize back office operations to keep pace with growth and ensure clients found the right therapeutic match, whether virtual or in-person.",
    "image": "https://images.unsplash.com/photo-1534972195531-d756b9bfa9f2?ixlib=rb-4.0.3&auto=format&fit=crop&w=800&q=80",
    "platform": "Web App, Internal Tool",
    "teamList": "1 Product Designer, 4 Engineers, 1 Data Scientist, 1 Product Manager",
    "sections": [
      { "heading": "Overview", "content": "Resilience Lab is a modern therapy collective leveraging data and design to deliver collaborative, high-quality mental healthcare. As pandemic restrictions eased and patient needs evolved, the company needed to automate and personalize back office operations to keep pace with growth and ensure clients found the right therapeutic match, whether virtual or in-person." },
      { "heading": "Challenge", "content": "The widening reach of hybrid care models introduced new complexity. Patient needs, therapist expertise, licensure by state, insurance network compatibility, and evolving preferences overwhelmed manual systems. Slow or imprecise matches impacted patient engagement and internal efficiency, while administrative teams faced escalating workloads." },
      { "heading": "Approach", "content": "Guided by double diamond methodology, I led a cross-functional process to research, ideate, prototype, and deliver a new matching engine:<br/><br/><strong>Discovery:</strong> Interviewed stakeholders across intake, therapy, and administration to identify friction points. Diagrams of existing processes revealed critical breakdowns in the alignment workflow.<br/><strong>Ideation & Prototyping:</strong> Documented and prioritized matching criteria: location, specialty, modality, insurance, caseload, preferences, and diversity goals. Created wireframes and interactive prototypes in Figma, iteratively tested in real-world intake scenarios.<br/><strong>Engineering Partnership:</strong> Collaborated with backend teams on algorithm logic and data flows. Built user-friendly dashboards for administrators to monitor and refine assignments.<br/><strong>Strategic Storytelling:</strong> Leveraged Axure and Figma prototypes to clearly articulate system vision and ROI during board meetings and fundraising rounds, ensuring executive alignment." },
      { "heading": "Key Solution", "content": "The automated system now algorithmically matches patients and therapists based on real-time criteria, instantly surfacing recommended pairings and reducing assignment times from days to minutes. Administrators have transparency and oversight with dashboards to intervene or customize as needed. Feedback loops allow continual refinement based on match success." },
      { "heading": "Outcome", "content": "<ul style='margin-left:1.5em; list-style: disc;'><li><strong>Efficiency:</strong> Back office team capacity increased dramatically, allowing Resilience Lab to meet surging demand without bottlenecks or burnout.</li><li><strong>Personalized Care:</strong> Patients are more seamlessly aligned to clinicians suited to their preferences, specialty needs, and logistical constraints.</li><li><strong>Scalability:</strong> The system equips Resilience Lab to grow sustainably, handling large volumes of new patients with minimal additional admin resources.</li><li><strong>Business Impact:</strong> As design leadership, I used high-fidelity interactive prototypes to convey product vision and workflow transformation, directly supporting the company’s successful $14 million Series A funding round.</li></ul>" },
      { "heading": "Reflections", "content": "This initiative illustrated how design and prototyping can do more than deliver user-centric systems—they can be instrumental in securing stakeholder confidence, unlocking funding, and fueling company growth. By coupling thoughtful automation with strategic storytelling, I helped Resilience Lab rapidly scale its mission of bringing better mental healthcare to all, at the moment it was most needed." }
    ],
    "role": "Design Leadership\nPrincipal Product Designer\nConsultation",
    "methodology": "Double Diamond\nAgile\nScrum"
  },
  {
    "id": "pearl",
    "title": "Transforming Value-Based Care Through Design-Driven Innovation",
    "company": "Pearl Health",
    "year": "2021–2022",
    "tags": ["USER EXPERIENCE", "STRATEGY", "LEADERSHIP"],
    "intro": "Pearl Health empowers independent primary care providers to thrive in value-based care models, surfacing clinically relevant, actionable insights via a platform that fits seamlessly into their everyday workflows. As the first product designer at Pearl, I played a foundational role—building the initial design language, conceiving the signature hex map patient interface, and helping evolve business strategy through thoughtful, human-centered design.",
    "image": "https://images.unsplash.com/photo-1515378791036-0648a3ef77b2?auto=format&fit=crop&w=800&q=80",
    "platform": "Web, Dashboard",
    "teamList": "6 Engineers, 3 Data Scientists, 1 Business Analyst, 1 Product Manager",
    "sections": [
      { "heading": "Overview", "content": "When I joined Pearl Health, the company was a small, fast-moving startup with a bold vision: make value-based care work for every independent physician in the country. As one of the first employees (#17) my charge was to bring this vision to life—distilling layers of analytics into tools that clinicians would not only understand, but love. The product needed to break down workflow silos, provide at-a-glance clarity, and inspire trust, both with internal stakeholders and in the field." },
      { "heading": "Challenge", "content": "Launching from zero, we faced the simultaneous challenge of crafting a compelling product vision for providers, investors, and our own internal teams. Without a demo or working prototype, it was hard to convey the transformative power of our approach, so we created one. The design had to instantly communicate value, reduce complexity for clinicians new to value-based care, and create a distinct identity for Pearl in a crowded market—all while scaling rapidly to support fundraising and go-to-market efforts." },
      { "heading": "Approach", "content": "<ul><li><strong>Design Leadership from Day One:</strong> As the founding designer, I led collaborative discovery with clinicians, engineers, and business leaders, mapping out core user journeys, requirements, and business needs.</li><li><strong>Inventing the Pearl Experience:</strong> I established the initial design language—prioritizing clarity, friendliness, and approachability. I invented the hex map visualization, allowing users to see population risk and opportunity at a glance—a concept that quickly became a signature feature of the platform.</li><li><strong>Prototyping to Accelerate Vision and Growth:</strong> With no existing application, I built detailed, interactive Figma and Axure prototypes demonstrating the dashboard, patient flows, and clinical impact. These clickable prototypes became core assets for the sales and growth teams and were instrumental in telling our story to investors.</li><li><strong>Human-Centered Perspective:</strong> Early patient stories and feedback loops ensured the interface not only looked good, but solved real-world pain points for clinicians and their patients.</li></ul>" },
      { "heading": "Solution", "content": "The product that emerged was a clinician-focused dashboard, built from my design groundwork, centered on the dynamic hex map and a modular set of UI patterns for risk, outreach, and follow-up. Instead of overwhelming users with data, the interface highlighted the “next best action” for each patient and made population health approachable, actionable, and even enjoyable to navigate." },
      { "heading": "Three Patient Stories", "content": "<ul><li><strong>“Samantha,” 82</strong>, was identified as high risk on the hex map due to a recent hospitalization. Her care team, alerted through our interface, promptly coordinated a follow-up—preventing costly complications.</li><li><strong>“James,” 67</strong>, surfaced for overdue lab work and deteriorating engagement. The clear visual cue inspired a successful nurse outreach that got him back on track with his diabetes care plan.</li><li><strong>“Maria,” 54</strong>, landed in a support-needed segment amid her Medicare transition. Guided by actionable prompts, her provider offered targeted social service referrals, improving her experience and outcomes.</li></ul>" },
      { "heading": "Outcome", "content": "<ul><li><strong>Investor and Growth Enablement:</strong> My design prototypes became the foundation for fundraising and early partner demos. These assets were crucial in securing Pearl’s $7M Series A and forming the narrative for a subsequent Series B.</li><li><strong>Sales & Onboarding:</strong> The prototypes were also adopted by sales and growth teams to give prospective clinics a firsthand “look and feel” experience—enabling rapid customer acquisition even before product launch.</li><li><strong>Distinct Identity:</strong> The initial design language and hex map visualization set a new, recognizable standard in value-based care tooling and gave Pearl a strong, differentiated brand in the market.</li><li><strong>Clinical Realities:</strong> The design system scaled from zero to serving real-world clinicians, leading to more targeted, successful patient interventions and measurable improvements in care quality and workflow efficiency.</li></ul>" },
      { "heading": "Reflections", "content": "Starting from a blank slate required vision, speed, and empathy. As the first product designer at Pearl Health, I was able to shape not just an application, but the foundation of a business—proving the power of design to accelerate growth, secure investment, and drive better healthcare for patients and physicians alike.<br/><br/>Joining Pearl Health as the first designer in a fast-paced startup environment was both a challenge and a privilege. I had the unique opportunity to shape not only the product’s user experience, but also the company’s design culture from the ground up. Working directly with the C-suite, I helped translate ambitious business goals into a tangible, user-centered application—bridging the gap between vision and execution. This close collaboration enabled rapid iteration, strategic alignment, and a shared sense of ownership that was critical to our success. The experience reinforced my belief in the power of design leadership to drive innovation, accelerate growth, and create meaningful impact for both clinicians and patients." }
    ],
    "role": "Founding Product Designer\nDesign Leadership",
    "methodology": "Human-Centered Design\nRapid Prototyping\nStartup/Lean UX"
  },
  {
    "id": "ayva",
    "title": "Ayva: Redesigning Surgical Care With a Digital Assistant",
    "company": "Bravado Health",
    "year": "2018–2021",
    "tags": ["PRODUCT DESIGN", "LEADERSHIP", "HEALTHCARE UX"],
    "intro": "Ayva, a product developed by Bravado Health, is a digital platform engineered to optimize and humanize pre- and post-operative surgical care. As Director of Product Design, I built and led a team of five, responsible for developing Ayva’s signature design language, user journey, and engagement strategy. The adoption and success of the Ayva platform played a significant role in Bravado Health’s successful acquisition.",
    "image": "https://images.unsplash.com/photo-1465101046530-73398c7f28ca?auto=format&fit=crop&w=800&q=80",
    "platform": "Web, Mobile",
    "teamList": "4 Product Designers, 8 Engineers, 1 UX Writer, 1 Business Analyst, 1 Product Owner, 1 Product Manager",
    "sections": [
      { "heading": "Overview", "content": "When I joined Bravado Health, the healthcare landscape was seeing a significant shift toward patient-centric digital platforms—yet surgical care remained one of the most stressful, fragmented, and analog experiences in medicine. Research showed that gaps in communication, low adherence to pre- and post-operative instructions, and insufficient support systems often led to surgery delays, preventable readmissions, and poor patient satisfaction.<br/><br/>Recognizing these challenges, Bravado Health set out to bridge the gap with Ayva: a platform that would reimagine how patients, their advocates, and care teams interact before and after surgery. Our vision was ambitious—transform complex medical instructions into clear, actionable steps, nurture patient confidence at every stage, and give care teams the oversight to drive timely, outcome-improving interventions.<br/><br/>Crucially, Ayva was designed to expand the circle of care by including not just clinical stakeholders but also patient-designated advocates—empowering friends, family, or neighbors to follow recovery progress and lend support where it matters most. The goal was to humanize and streamline surgery preparation and recovery with technology, making higher-value care accessible and scalable for providers, patients, and their loved ones. As Director of Product Design, I was responsible for translating these strategic priorities into a cohesive, intuitive, and compelling digital experience from the ground up." },
      { "heading": "Challenge", "content": "Surgery can be overwhelming, and patients often struggle to follow complex instructions, leading to avoidable complications or readmissions. Traditional care models failed to deliver real-time feedback, personalized support, or include friends and family as part of the healing process. There was a crucial need to create a platform that would guide patients with empathy, provide actionable insights for case managers to intervene proactively, and enable advocates to track and support loved ones’ surgical recoveries." },
      { "heading": "Approach", "content": "<ul><li><strong>Design Leadership:</strong> As Director, I formed and mentored a multidisciplinary design team, fostering a rapid-prototyping, user-centered environment.</li><li><strong>Comprehensive Journey Mapping:</strong> Through extensive research with patients, clinicians, and case managers, we identified gaps in communication, adherence, and support throughout the surgical timeline.</li><li><strong>End-to-End Prototyping:</strong> Established Ayva’s design language and user interface in Figma, creating high-fidelity interactive prototypes that drove internal alignment and became cornerstone assets for sales, growth, and acquisition conversations.</li><li><strong>Empowering the Whole Circle of Care:</strong> Developed features for case managers to visualize patient adherence and milestones at a glance, enabling timely interventions. Designed an advocate experience—giving designated friends, family, or neighbors access to key patient progress and actionable reminders for both pre- and post-op involvement.</li><li><strong>Business Value Demonstration:</strong> Leveraged prototypes to showcase Ayva’s multi-stakeholder impact in partner, client, and acquisition settings.</li></ul>" },
      { "heading": "Key Solutions", "content": "<ul style='margin-left:1.5em; list-style: disc;'><li><strong>Conversational Checklists:</strong> Step-by-step, interactive instructions for patients, tailored to their procedure and timeline.</li><li><strong>Advocate Access:</strong> Patients can invite a trusted friend or family member to follow their progress and receive reminders, expanding the circle of care.</li><li><strong>Real-Time Dashboards:</strong> Case managers monitor patient adherence, milestones, and issues at a glance, enabling timely interventions.</li><li><strong>Secure Messaging:</strong> HIPAA-compliant, two-way communication between patients and care teams for questions, support, and follow-up.</li><li><strong>Educational Modules:</strong> Bite-sized, accessible content to help patients understand their care and recovery process.</li><li><strong>Automated Reminders:</strong> Personalized notifications for medication, appointments, and key recovery steps.</li><li><strong>Accessibility & Empathy:</strong> Designed for clarity, inclusivity, and emotional support throughout the surgical journey.</li></ul>" },
      { "heading": "Outcome", "content": "<ul><li><strong>Patient Empowerment:</strong> Patients using Ayva felt informed, supported, and less anxious, leading to improved adherence throughout their surgical journey.</li><li><strong>Case Manager Efficiency:</strong> Care teams were able to spot issues sooner and provide targeted interventions, reducing complications and readmissions.</li><li><strong>Advocate Engagement:</strong> The advocate feature activated a patient’s personal support network, improving outcomes and satisfaction.</li><li><strong>Acquisition Success:</strong> The adoption, engagement rates, and demonstrated value of Ayva were significant contributors to Bravado Health’s acquisition. The design system and workflows supporting multiple stakeholders were frequently highlighted in acquisition discussions.</li><li><strong>Team Culture:</strong> Under my leadership, Ayva’s design team set a new standard for digital health UX, combining clinical rigor, empathy, and agile delivery.</li></ul>" },
      { "heading": "Reflections", "content": "The journey of building Ayva with Bravado Health reinforced the impact design can have on patient care and business outcomes. By enabling real-time insights, collaborative care, and advocate empowerment, Ayva advanced the standard for surgical recovery—and became a defining asset in Bravado Health’s success and acquisition.<br/><br/>Guiding a growing team through the uncertainty of the COVID-19 pandemic was a transformative responsibility. I was tasked not only with delivering a high-impact product, but also with cultivating resilience, empathy, and professional growth within my team. Mentoring young designers during this period was especially meaningful—helping them navigate remote collaboration, build confidence, and develop their own voices as contributors to a mission-driven product. This experience deepened my appreciation for the role of leadership in nurturing talent and sustaining momentum, even in the most unpredictable times." }
    ],
    "role": "Director of Product Design\nTeam Leadership",
    "methodology": "User-Centered Design\nJourney Mapping\nRapid Prototyping\nAgile"
  }
] 